from tkinter import *

class App(Tk):
    def __init__(self):
        self.geometry('600x800')
        self.matn="""
        نکاتی نیز در موضوع دستور این زبان نوشته‌است. این کتاب در واقع نخستین پژوهشی است
         که به زبان فارسی در این حوزه انجام شده‌است. در نسخهٔ ادغام‌شدهٔ این دو ک
          علاوه بر بازنشر متن کامل آن‌ها، مقاله‌های دیگری هم که پس از انتشار آن‌ها تألیف شده
         ، چاپ شده‌است که برخی از آن مقاله‌ها نوشتهٔ شرق‌شناسان خارجی و برخی دیگر نوشتهٔ خود 
         اقتداری است. سید صادق سجادی لارستان کهن را یکی از اولین آثاری می‌داند که می‌تواند 
         عنوان «تاریخ محلی» به خود بگیرد. از سوی دیگر اما سید محمدکاظم صحبت‌زاده معتقد است 
         این کتاب دارای دقت تاریخی بالایی نیست و ارجاعات ناقص و عدم ضبط دقیق تلفظ و
         اژگان در این کتاب، موجب دشواری کار پژوهشگران می‌شود. 
        """
        print(self.matn)
    def create_widget(self):
        self.lbl = Label(self,text = self.matn)



a = App()
a.mainloop()